In [1]:
import pandas as pd

In [3]:
autors = pd.DataFrame({"author_id": [1, 2, 3], 
                      "author_name": ["Тургенев", "Чехов", "Островский"]})
book = pd.DataFrame({"author_id": [1, 1, 1, 2, 2, 3, 3], 
                    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                    "price": [450, 300, 350, 500, 450, 370, 290]})

In [12]:
authors_price = pd.merge(autors, book, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [15]:
authors_price["cover"] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [21]:
book_info = authors_price.reset_index().pivot_table(index='author_name', columns='cover', values='price')
book_info

cover        мягкая  твердая
author_name
Островский    330.0      NaN
Тургенев      325.0    450.0
Чехов           NaN    475.0

In [23]:
book_info['мягкая'].fillna(0, inplace=True)
book_info['твердая'].fillna(0, inplace=True)
book_info

cover        мягкая  твердая
author_name
Островский    330.0      0.0
Тургенев      325.0    450.0
Чехов           0.0    475.0

In [24]:
import pickle

In [34]:
with open("book_info.pkl", "wb") as f:
    pickle.dump(book_info, f)

In [35]:
with open("book_info.pkl", "rb") as f:
    book_info2 = pickle.load(f)

In [36]:
book_info2

cover        мягкая  твердая
author_name
Островский    330.0      0.0
Тургенев      325.0    450.0
Чехов           0.0    475.0